Диплом/src/Documents/ПеремещениеТоваровМатериалов/ПеремещениеТоваровМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваровМатериалов</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериаловИТоваров</registerRecords>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеМатериала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыДляПеремещения</name>
    <attributes>
      <name>Номенклатура_Материалов</name>
      <type>
        <types>CatalogRef.РасходникиДляПроизводства_Номенклатура</types>
        <types>CatalogRef.ЛесСырьё_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМатериалов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыДляПеремещения</name>
    <attributes>
      <name>Номенклатура_Товаров</name>
      <type>
        <types>CatalogRef.ДеревянныеЩиты_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницаИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Documents/ПеремещениеТоваровМатериалов/ManagerModule.bsl
Процедура ПечатьДок(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДок)
	Макет = Документы.ПеремещениеТоваровМатериалов.ПолучитьМакет("ПечатьДок");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеТоваровМатериалов.Дата,
	|	ПеремещениеТоваровМатериалов.Номер,
	|	ПеремещениеТоваровМатериалов.ОтветственноеЛицо,
	|	ПеремещениеТоваровМатериалов.Отправитель,
	|	ПеремещениеТоваровМатериалов.ПеремещениеМатериала,
	|	ПеремещениеТоваровМатериалов.ПеремещениеТовара,
	|	ПеремещениеТоваровМатериалов.Получатель,
	|	ПеремещениеТоваровМатериалов.МатериалыДляПеремещения.(
	|		НомерСтроки,
	|		Номенклатура_Материалов,
	|		КоличествоМатериалов,
	|		ЕдиницаИзмерения
	|	),
	|	ПеремещениеТоваровМатериалов.ТоварыДляПеремещения.(
	|		НомерСтроки,
	|		Номенклатура_Товаров,
	|		Количество,
	|		ЕдиницаИзмерения
	|	)
	|ИЗ
	|	Документ.ПеремещениеТоваровМатериалов КАК ПеремещениеТоваровМатериалов
	|ГДЕ
	|	ПеремещениеТоваровМатериалов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМатериалыДляПеремещенияШапка = Макет.ПолучитьОбласть("МатериалыДляПеремещенияШапка");
	ОбластьМатериалыДляПеремещения = Макет.ПолучитьОбласть("МатериалыДляПеремещения");
	ОбластьТоварыДляПеремещенияШапка = Макет.ПолучитьОбласть("ТоварыДляПеремещенияШапка");
	ОбластьТоварыДляПеремещения = Макет.ПолучитьОбласть("ТоварыДляПеремещения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьМатериалыДляПеремещенияШапка);
		ВыборкаМатериалыДляПеремещения = Выборка.МатериалыДляПеремещения.Выбрать();
		Пока ВыборкаМатериалыДляПеремещения.Следующий() Цикл
			ОбластьМатериалыДляПеремещения.Параметры.Заполнить(ВыборкаМатериалыДляПеремещения);
			ТабДок.Вывести(ОбластьМатериалыДляПеремещения, ВыборкаМатериалыДляПеремещения.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьТоварыДляПеремещенияШапка);
		ВыборкаТоварыДляПеремещения = Выборка.ТоварыДляПеремещения.Выбрать();
		Пока ВыборкаТоварыДляПеремещения.Следующий() Цикл
			ОбластьТоварыДляПеремещения.Параметры.Заполнить(ВыборкаТоварыДляПеремещения);
			ТабДок.Вывести(ОбластьТоварыДляПеремещения, ВыборкаТоварыДляПеремещения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
